# TASK 1
# Напишите программу, которая принимает на вход цифру, 
# обозначающую день недели, и проверяет, является ли этот день выходным.

# Пример:

# - 6 -> да
# - 7 -> да
# - 1 -> нет

# Ршение//////////////////////////////////////////


# day = int(input("Введите номер дня недели: "))

# if day <= 5:
#     print("Рабочий день.")
# elif day == 6 or day == 7:
#     print("Выходной день.")
# else:
#     print("Не верно введён номер дня недели, введите номер от 1 до 7!")  

# //////////////////////////////////////////////////////////  

# TASK 2
# Напишите программу для. проверки истинности утверждения 
# ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

# Ршение//////////////////////////////////////////

# for x in range(0,2):
#     for y in range(0,2):
#         for z in range(0,2):
#            print(not(x or y or z)== (not(x) and not(y) and not(z)))            

# //////////////////////////////////////////////////////////


# TASK 3
# Напишите программу, которая принимает на вход координаты точки (X и Y), 
# причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, 
# в которой находится эта точка (или на какой оси она находится).

# Пример:

# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3

# Ршение//////////////////////////////////////////

# X = int(input("Введите координаты точки X: ")) 
# Y = int(input("Введите координаты точки Y: "))

# if X > 0 and Y > 0:
#     print("Номер четверти -> 1")
# elif X < 0 and Y > 0:
#     print("Номер четверти -> 2")
# elif X < 0 and Y < 0:
#     print("Номер четверти -> 3")
# elif X > 0 and Y < 0:
#     print("Номер четверти -> 4")
# elif X == 0 and Y == 0:
#     print("Ошибка!")

# //////////////////////////////////////////////////////////

# TASK 4
# Напишите программу, которая по заданному номеру четверти, 
# показывает диапазон возможных координат точек в этой четверти (x и y).

# Ршение//////////////////////////////////////////

# numbers = int(input("Введите номер четверти: ")) 

# if numbers == 1:
#     print("Диапазон возможных координат :x > 0 и y > 0")
# elif numbers == 2:
#     print("Диапазон возможных координат :x < 0 и y > 0")
# elif numbers == 3:
#     print("Диапазон возможных координат :x < 0 и y < 0")
# elif numbers == 4:
#     print("Диапазон возможных координат :x > 0 и y < 0")
# else:
#     print("Не верно введён номер четверти, введите номер от 1 до 4!")   

# //////////////////////////////////////////////////////////

# TASK 5
# Напишите программу, которая принимает на вход координаты двух точек и находит 
# расстояние между ними в 2D пространстве.

# Пример:

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

# Ршение//////////////////////////////////////////

# ax = int(input("Введите первую координату точки А: "))
# ay = int(input("Введите вторую координату точки А: "))
# bx = int(input("Введите первую координату точки B: "))
# by = int(input("Введите вторую координату точки B: "))
# ac = ay - by 
# bc = bx - ax
# print(int((ac**2 + bc**2)**0.5*100)/100)

# //////////////////////////////////////////////////////////